name: "yolov4_onnx"
platform: "onnxruntime_onnx"
max_batch_size : 32
input [
  {
    name: "input"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [  3, 512, 512 ]
  }
]
output [
  {
    name: "confs"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  },
  {
    name: "boxes"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1 ]
  }
]
