name: "ensemble_python_yolov4"
platform: "ensemble"
max_batch_size:8

input [
 {
   name: "INPUT"
   data_type:TYPE_UINT8
   dims: [-1]
 }
]
output [
 {
   name: "OUTPUT"
   data_type: TYPE_FP32
   dims: [-1, 7]
 }
]

ensemble_scheduling{
  step[
    {
      model_name: "preprocess"
      model_version: -1
      input_map{
        key: "INPUT_0"
        value: "INPUT"
      }
      output_map{
        key: "OUTPUT_0"
        value: "preprocessed_images"
      }
    },
    {
      model_name: "yolov4_tensorrt"
      model_version: -1
      input_map{
        key: "input"
        value: "preprocessed_images"
      }
      output_map{
        key: "confs"
        value: "output_confs"
      }
      output_map{
        key: "boxes"
        value: "output_boxes"
      }
    },
    {
      model_name: "proprocess"
      model_version: -1
      input_map{
        key: "INPUT_CONFS"
        value: "output_confs"
      } 
      input_map{
        key: "INPUT_BOXES"
        value: "output_boxes"
      }
      output_map{
        key: "OUTPUT_RES"
        value: "OUTPUT"
      }
    }  
  ]
}
